{
  "term": "Spring",
  "year": "2009",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Teaching and Education",
      "Curriculum and Teaching"
    ],
    [
      "Teaching and Education",
      "Higher Education"
    ]
  ],
  "legacy_uid": "2cfbc0b5-6afd-347c-0a4d-ee9216ca1f8e",
  "instructors": {
    "content": [
      "583cc582-1f48-236c-af5a-b2f4750fef40"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "d88fdbd5-3c84-6d74-0566-1b773ab64d9f",
    "website": "res-18-004-the-torch-or-the-firehose-a-guide-to-section-teaching-spring-2009"
  },
  "course_title": "The Torch or The Firehose: A Guide to Section Teaching",
  "hide_download": false,
  "course_description": "“*Getting an education at MIT is like trying to drink from a firehose.*”\n\n— folk saying\n\n*The Torch or The Firehose: A Guide to Section Teaching*, by MIT Mathematics Professor Arthur Mattuck, is a guide to recitation teaching at MIT. During a typical recitation section, a teaching assistant (TA) meets with a small group of students to review the most recent lecture, expand on the concepts, work through practice problems, and conduct a discussion with the students. With good humor and sound advice, Professor Mattuck offers both novice and seasoned recitation instructors guidelines on how sections can best serve as a complement to lectures, how to help students become better learners, and how to enjoy their experience as recitation teachers. Lecturers claim they have learned something from it, too.\n\nThis content was first published as a printed booklet in 1981. This is the second edition. It has had a wide distribution, both at MIT and other universities, since it first appeared. It is finally available in digital format to allow broader distribution and use of this valuable material.\n\nIf any significant changes are required to adapt it to the needs of another institution, please clearly notify readers that the work is modified from the orginal version and provide a link to this web site. For archival purposes, translators should notify {{% resource_link \"7e77ff4f-8952-456a-b877-f5939ae6ec4b\" \"MIT OpenCourseWare\" %}} of their version.",
  "department_numbers": [
    "18"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "RES.18-004",
  "course_image_thumbnail": {
    "content": "01c44590-264d-e69a-ffb9-ca4d8dadadb4",
    "website": "res-18-004-the-torch-or-the-firehose-a-guide-to-section-teaching-spring-2009"
  },
  "learning_resource_types": [
    "Open Textbooks"
  ],
  "site_uid": "bca3be0a-73b7-48b2-8e37-dca2f4a27138",
  "site_short_id": "res.18-004-spring-2009",
  "site_url_path": "courses/res-18-004-the-torch-or-the-firehose-a-guide-to-section-teaching-spring-2009",
  "title": "Course Metadata"
}